#+PROPERTY: header-args :tangle yes
# -*- org-babel-hide-result-overlays: t; -*-

*** Font
The best programming font I know of is Cascadia Code.
#+begin_src elisp
(setq doom-font (font-spec :family "Cascadia Code" :size 16))
(doom/reload-font)
#+end_src

Also, add some line spacing.
#+begin_src elisp
(setq-default line-spacing 5)
#+end_src

#+RESULTS:
: 5

*** Helm text un-enlargement
#+begin_src elisp
(setq +helm-posframe-text-scale 0)
#+end_src

#+RESULTS:
: 0

*** Doom Modeline
#+begin_src elisp
(doom-modeline-mode t)
(setq doom-modeline-height 36)
#+end_src

#+RESULTS:
: 36

*** Olivetti
#+begin_src elisp
(use-package! olivetti
  :config
  (setq olivetti-body-width '100
        olivetti-margin-width '20
        olivetti-style t)
  :hook (org-mode . olivetti-mode))
#+end_src

#+RESULTS:
| (closure ((hook . org-mode-hook) (--dolist-tail--) t) (&rest _) (add-hook 'before-save-hook 'org-encrypt-entries nil t)) | er/add-org-mode-expansions | evil-better-visual-line-on | org-ref-org-menu | (closure ((hook . org-mode-hook) (--dolist-tail--) t) (&rest _) (add-hook 'before-save-hook 'org-encrypt-entries nil t)) | org-ref-prettify-mode | +lookup--init-org-mode-handlers-h | (closure ((hook . org-mode-hook) (--dolist-tail--) t) (&rest _) (add-hook 'before-save-hook 'org-encrypt-entries nil t)) | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | (lambda nil (global-hl-line-mode -1)) | (lambda nil (global-display-line-numbers-mode -1)) | org-variable-pitch-minor-mode | olivetti-mode | org-superstar-mode | doom-disable-show-paren-mode-h | doom-disable-show-trailing-whitespace-h | +org-enable-auto-reformat-tables-h | +org-enable-auto-update-cookies-h | +org-make-last-point-visible-h | evil-org-mode | toc-org-enable | flyspell-mode | embrace-org-mode-hook | org-eldoc-load | +literate-enable-recompile-h |

*** Latex Configuration
These are necessary for something, I'm not sure why but I'll keep them anyway.
#+begin_src elisp
(require 'org-ref-scopus)
(require 'org-ref-pubmed)
(require 'org-ref-sci-id)
#+end_src

#+RESULTS:
: org-ref-sci-id

CSL styles are found under [[~/.emacs.doom/.local/straight/repos/org-ref/citeproc/csl-styles/]]
Possibilities are: 
- ~elsevier-with-titles.csl~
- ~chicago-author-date-16th-edition.csl~
- ~apa-5th-edition.csl~
- ~elsevier-harvard.csl~
- ~apa-numeric-superscript-brackets.csl~
 
I also have my own styles in [[~/.emacs.doom/tex/csl/]]. More can be found online at https://github.com/citation-style-language/styles
#+begin_src emacs-lisp
(setq org-ref-csl-default-style "~/.emacs.doom/tex/csl/association-for-computing-machinery.csl")
#+end_src

#+RESULTS:
: ~/.emacs.doom/tex/csl/association-for-computing-machinery.csl

Set up the default bibliography and export variables:
#+begin_src emacs-lisp :tangle yes
(setq org-ref-default-bibliography "~/notes/pages/sources.bib")
(setq reftex-default-bibliography "~/notes/pages/sources.bib")
(setq org-export-with-broken-links t)
(setq latex-run-command "xelatex")
(setq bibtex-dialect 'biblatex)
(setq org-cite-export-processors nil)
;(setq org-cite-biblatex-options "backend=bibtex,sortcites=true,citestyle=numeric-comp,defernumbers=true") isn't usedanymore ecause not processing with org-cite
(setq org-latex-pdf-process
'("%latex -interaction nonstopmode -output-directory %o %f" "bibtex %b" "%latex -interaction nonstopmode -output-directory %o %f" "%latex -interaction nonstopmode -output-directory %o %f"))

#+end_src

#+RESULTS:
| %latex -interaction nonstopmode -output-directory %o %f | bibtex %b | %latex -interaction nonstopmode -output-directory %o %f | %latex -interaction nonstopmode -output-directory %o %f |

Always use these packages in latex exports.
#+begin_src elisp
(setq org-latex-default-packages-alist '(("AUTO" "inputenc" t
                                     ('latex-run-command))
                                        ("T1" "fontenc" t
                                     ('latex-run-command))
                                        (#1="" "graphicx" t)
                                        (#1# "grffile" t)
                                        ("backend=bibtex,sortcites=true,style=numeric-comp,defernumbers=true" "biblatex" t)
                                        ;("numbers,sort&compress" "natbib" t)
                                        (#1# "longtable" nil)
                                        (#1# "wrapfig" nil)
                                        (#1# "rotating" nil)
                                        ("normalem" "ulem" t)
                                        (#1# "amsmath" t)
                                        (#1# "textcomp" t)
                                        (#1# "amssymb" t)
                                        (#1# "capt-of" nil)
                                        (#1# "hyperref" nil)))

#+end_src

*** Bibliography stuff
#+begin_src elisp
(setq
 bibtex-autokey-titlewords 3
 bibtex-completion-bibliography '("~/notes/pages/sources.bib")
 bibtex-completion-library-path '("~/notes/pages/bibtex-pdfs/"))

(use-package! helm-bibtex
  :after org-ref)
#+end_src

#+RESULTS:
| ~/notes/pages/bibtex-pdfs/ |

*** Misc config
#+begin_src elisp
(add-hook! org-agenda #'org-agenda-to-appt)
(map! :map global :m "C-c a" 'org-agenda)

(after! org
  (setq org-agenda-columns-add-appointments-to-effort-sum t
        org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "PROG(r)" "EXTD(e!)" "POST(p@!/@!)" "|" "DONE(d!)" "CNCL(c@!/@!)"  "FAIL(f!)"))
        org-agenda-span 1
        org-deadline-warning-days 99
        org-agenda-skip-deadline-if-done nil
        org-habit-show-all-today t
        org-habit-show-habits-only-for-today nil
        org-agenda-start-day "-0d"
        org-agenda-skip-timestamp-if-done nil
        org-agenda-skip-deadline-if-done nil
        org-agenda-skip-scheduled-if-deadline-is-shown 'not-today;'repeated-after-deadline
        org-agenda-skip-timestamp-if-deadline-is-shown nil
        org-agenda-entry-text-maxlines 20
        org-agenda-include-diary t
        org-agenda-prefix-format " %?-3t %-11s %3e "
        org-agenda-keyword-format '("")
        org-agenda-remove-tags t
        org-agenda-sorting-strategy '(;(agenda deadline-down todo-state-up effort-down priority-down  category-keep)
                                      (agenda time-up deadline-up priority-down todo-state-down effort-down scheduled-up)
                                      (todo priority-down category-keep)
                                      (tags priority-down category-keep)
                                      (search category-keep))
        org-agenda-skip-scheduled-if-done t
        org-agenda-span 'day))

(after! org
  (setq org-agenda-custom-commands
        '(("g" "Good agenda"
           ((agenda ""
                    ((org-agenda-overriding-header "Agenda and Tonight's Homework")))
            (alltodo ""
                     ((org-agenda-overriding-header "PROJECTS")
                      (org-agenda-prefix-format " %?-3t %?-11s %3e ")
                      (org-super-agenda-groups
                       '((:discard (:todo "SOMEDAY" :not (:tag "PROJECT")))
                         (:auto-outline-path t)
                         (:discard
                          (:anything))))))
            (alltodo ""
                     ((org-agenda-overriding-header "Other")
                      (org-agenda-prefix-format " %?-3t %3e ")
                      (org-super-agenda-groups
                       '((:name "Bucket List" :and
                          (:todo "SOMEDAY" :tag "PERSONAL")
                          :order 1)
                         (:name "Someday Maybe" :todo "SOMEDAY" :order 10)
                         (:name "Everything Else" :anything t :order 20))))))
           nil nil)
          ("n" "Agenda and all TODOs"
           ((agenda "" nil)
            (alltodo "" nil))
           nil))))
    #+end_src

    #+RESULTS:
    | g | Good agenda          | ((agenda  ((org-agenda-overriding-header Agenda and Tonight's Homework))) (alltodo  ((org-agenda-overriding-header PROJECTS) (org-agenda-prefix-format  %?-3t %?-11s %3e ) (org-super-agenda-groups '((:discard (:todo SOMEDAY :not (:tag PROJECT))) (:auto-outline-path t) (:discard (:anything)))))) (alltodo  ((org-agenda-overriding-header Other) (org-agenda-prefix-format  %?-3t %3e ) (org-super-agenda-groups '((:name Bucket List :and (:todo SOMEDAY :tag PERSONAL) :order 1) (:name Someday Maybe :todo SOMEDAY :order 10) (:name Everything Else :anything t :order 20)))))) | nil | nil |
    | n | Agenda and all TODOs | ((agenda  nil) (alltodo  nil))                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            | nil |     |

*** Capture Templates
:PROPERTIES:
:ID:       2698de88-4357-4b92-b7b7-e252794cae20
:END:
#+begin_src elisp
  (global-set-key (kbd "C-c c") 'org-capture)
  (setq org-capture-templates
        '(("p" "Personal TODO" entry
           (file+headline "~/Documents/personal.org" "Personal TODO list")
           "* TODO %^{Headline} :personal:%^{Tags}:
SCHEDULED: %^{Scheduled}t DEADLINE: %^{Deadline}t
:PROPERTIES:
:EFFORT: %^{Effort}
:END:
  ")
          ("H" "Habit" entry
           (file+headline "~/Documents/personal.org" "Personal TODO list")
           "* TODO %^{Headline} :personal:habit:%^{Tags}:
SCHEDULED: %^{Scheduled}t
:PROPERTIES:
:EFFORT: %^{Effort}
:STYLE: habit
:END:
  ")
          ("n" "Quick note" entry
           (file+headline "~/Documents/personal.org" "Quick Notes")
           "* %^{Headline}
      ENTERED: %U
    " :prepend t)
          ("a" "Test/Assessment/Quiz " entry
           (file "~/org/todo.org")
           "* %^{Test Name} :school:%^{Tags}:
DEADLINE: %^{Deadline}t ENTERED: %U" :prepend t :time-prompt t)
        ("P" "Project TODO" entry
         (file "~/org/todo.org")
         "* TODO %^{Project name} [/] :project:%^{Tags}:
SCHEDULED: %^{Scheduled}t DEADLINE: %^{Deadline}t ENTERED: %U" :prepend t :time-prompt t)
        ("e" "Email TODO" entry
         (file "~/org/todo.org")
         "* TODO %^{Task} :email:%^{Tags}:
DEADLINE: %^{Deadline}t ENTERED: %U" :prepend t :time-prompt t)
        ("m" "Meeting entry" entry
         (file "~/org/todo.org")
         "* %^{prompt} :meeting:%^{tags}:
    DEADLINE: %^{Deadline}T ENTERED: %U" :prepend t :time-prompt t)
        ("h" "Homework entry" entry
         (file "~/org/todo.org")
         "* TODO %^{prompt}    :school:homework:
DEADLINE: %^{Deadline}t ENTERED %U
:PROPERTIES:
:EFFORT: %^{Effort}
:END:
  " :prepend t :time-prompt t)))
#+end_src

#+RESULTS:
| p | Personal TODO | entry | (file+headline ~/Documents/personal.org Personal TODO list) | * TODO %^{Headline} :personal:%^{Tags}: |

** List promotion and demotion
#+begin_src elisp
(after! org (setq org-list-demote-modify-bullet '(("-" . "+") ("+" . "*") ("*" . "*"))))
#+end_src

#+RESULTS:
: ((- . +) (+ . *) (* . *))

